In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() #deita fora todas as linhas que tiverem valor nan (nulo)

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1) #deita fora as colunas

   C
0  1
1  2
2  3

In [8]:
#NOVAMENTE, PARA APAGAR DA DF TEMOS DE USAR O INPLACE

In [9]:
df.dropna(thresh=2) #mantem as linhas com, no minimo, 2 valores nao null

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
df.fillna(value='FILL VALUE') #preenche os null

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [12]:
df['A'].fillna(value=df['A'].mean()) #preenche o null com a media dos valores da coluna

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64